results/ASPLOS/WILDFIRE/YCSB-ROCKSDB-CORUN/batchsize-512/50M-KEYS/ycsbwklde/8/Vanilla.out
RocksDB:    version 5.4
Date:       Sat Mar  2 23:35:17 2024
CPU:        128 * AMD EPYC 7543 32-Core Processor
CPUCache:   512 KB
Initializing RocksDB Options from the specified file
Initializing RocksDB Options from command-line flags
Keys:       20 bytes each
Values:     4096 bytes each (2048 bytes after compression)
Entries:    50000000
Prefix:    20 bytes
Keys per prefix:    0
RawSize:    196266.2 MB (estimated)
FileSize:   98609.9 MB (estimated)
Write rate: 0 bytes/second
Read rate: 0 ops/second
Compression: NoCompression
Memtablerep: prefix_hash
Perf Level: 1
------------------------------------------------
DB path: [/users/kannan11/ssd/ioopt/appbench/apps/RocksDB-YCSB/DATA]
ycsbwklde    :     376.502 micros/op 2656 ops/sec; ( reads:10482 writes:517 total:50000000 found:0)
	Command being timed: "./db_bench --db=/users/kannan11/ssd/ioopt/appbench/apps/RocksDB-YCSB/DATA --num_levels=6 --key_size=20 --prefix_size=20 --memtablerep=prefix_hash --bloom_bits=10 --bloom_locality=1 --use_existing_db=1 --num=50000000 --duration=30 --compression_type=none --value_size=4096 --threads=8 --benchmarks=ycsbwklde --use_existing_db=1 --mmap_read=0 --threads=8"
	User time (seconds): 55.38
	System time (seconds): 23.67
	Percent of CPU this job got: 216%
	Elapsed (wall clock) time (h:mm:ss or m:ss): 0:36.49
	Average shared text size (kbytes): 0
	Average unshared data size (kbytes): 0
	Average stack size (kbytes): 0
	Average total size (kbytes): 0
	Maximum resident set size (kbytes): 1642484
	Average resident set size (kbytes): 0
	Major (requiring I/O) page faults: 72
	Minor (reclaiming a frame) page faults: 685507
	Voluntary context switches: 2763491
	Involuntary context switches: 287
	Swaps: 0
	File system inputs: 27271184
	File system outputs: 2217008
	Socket messages sent: 0
	Socket messages received: 0
	Signals delivered: 0
	Page size (bytes): 4096
	Exit status: 0
[ 4681.984591] sh (37888): drop_caches: 3
[ 4682.049545] sh (37895): drop_caches: 3